from flask import Flask,render_template
from flask import request
import app
import re
import pandas as pd
import os

app=Flask(__name__)
@app.route('/')
def index():
    return render_template("f1.html")
@app.route('/nomalise',methods=['POST','GET'])
def norma():


    lx = []
    my_file1 = open('lexicon.csv', encoding="utf8")
    lx = [i.split() for i in my_file1]
    #a.write (lx)
    f1=request.form['f1']
    f4=open(f1, 'r',encoding='utf-8-sig', errors='ignore')
    st = [i.split() for i in f4]
    #print (st)
    a = open('finaloutputwithroots.txt','w',encoding='utf8')
    a.write("TOKEN_NO"+"\t"+"PREFIX"+"\t"+"STEM"+"\t"+"SUFFIX"+"\t"+"CATEGORY"+"\n")
    g = open('finaloutputwithoutroot.txt','w',encoding='utf8')
    g.write("TOKEN_NO"+"\t"+"PREFIX"+"\t"+"STEM"+"\t"+"SUFFIX"+"\t"+"STATUS"+"\n")
    for s in st:
        flag = 0
        for l in lx:
            if s[3] == '-' and s[5] == '-':
                if s[4].startswith(tuple(l)) and s[4].endswith(tuple(l)):
                    flag = 1
                    if l[1] =='J':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಗುಣವಾಚಕ"+"\n")
                    elif l[1] =='D':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾವಿಶೇಷಣ"+"\n")
                    elif l[1] =='A':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಅವ್ಯಯ್ಯ"+"\n")
                    elif l[1] =='N':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\n")
                    elif l[1] =='V':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\n")
        if flag == 0:
            if s[3] == '-' and s[5] == '-':
                g.write(s[1]+"\t"+s[2]+"\t"+"Root word is not in the lexicon"+"\n")
        if flag == 0:
            if s[0] == '1':
                g.write(s[1]+"\t"+s[2]+"\t"+"Root word is not in the lexicon"+"\n")     

        flag = 0
        for l in lx:
            if s[0] == '2':
                if s[4].startswith(tuple(l)) and s[4].endswith(tuple(l)):
                    flag = 1
                    if l[1] =='J':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಗುಣವಾಚಕ"+"\n")
                    elif l[1] =='D':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾವಿಶೇಷಣ"+"\n")
                    elif l[1] =='A':
                        a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಅವ್ಯಯ್ಯ"+"\n")
                    elif l[1] =='N':
                        if [sub for sub in l[3] if sub in s[6]]:
                            if s[7] == '1':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಪ್ರತಮಾ ವಿಭಕ್ತಿ, ಏಕ ವಚನಾ"+"\n")
                            if s[7]=='2':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಪ್ರತಮಾ ವಿಭಕ್ತಿ, ಬಾಹು ವಚನಾ"+"\n")
                            if s[7]=='3':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಡಿವಿತಿಯಾ ವಿಭಕ್ತಿ, ಏಕ ವಚನಾ"+"\n")
                            if s[7]=='4':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಡಿವಿಥಿಯಾ ವಿಭಕ್ತಿ, ಬಹು ವಚನಾ"+"\n")
                            if s[7]=='5':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಥ್ರೂಟಿಯಾ ವಿಭಕ್ತಿ, ಏಕ ವಚನಾ"+"\n")
                            if s[7]=='6':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಥ್ರೂಟಿಯಾ ವಿಭಕ್ತಿ, ಬಹು ವಚನಾ"+"\n")
                            if s[7]=='7':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಚತುರ್ಥಿ, ಏಕ ವಚನಾ"+"\n")
                            if s[7]=='8':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಚತುರ್ಥಿ ವಿಭಕ್ತಿ, ಬಾಹು ವಚನಾ"+"\n")
                            if s[7]=='9':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಶಸ್ತಿ ವಿಭಕ್ತಿ, ಏಕ ವಚನಾ"+"\n")
                            if s[7]=='10':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಶಷ್ಟಿ ವಿಭಕ್ತಿ, ಬಹು ವಚನಾ"+"\n")
                            if s[7]=='11':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಸಪ್ತಮಿ, ಇಕಾ ವಚನಾ"+"\n")
                            if s[7]=='12':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಸಪ್ತಮಿ ವಿಭಕ್ತಿ, ಬಾಹು ವಚನಾ"+"\n")
                            if s[7]=='13':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಸಂಭೋಧನ ಪ್ರತಿಮಾ ವಿಭಕ್ತಿ, ಏಕ ವಚನಾ"+"\n")
                            if s[7]=='14':
                                a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ನಾಮಪದ"+"\t"+l[2]+"\t"+"ಸಂಭೋಧನ ಪ್ರತಿಮಾ ವಿಭಕ್ತಿ, ಬಹು ವಚನಾ"+"\n")
                    elif l[1] =='V':
                        if s[6].startswith(l[4]) or s[6].startswith(l[3]) or s[6].startswith(l[2]):
                            if s[7] == '1':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭೂತಕಾಲ"+"\t"+ "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t"+ "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t"+ "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                            if s[7] == '2':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭೂತಕಾಲ"+"\t"+"ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t"+"ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t"+"ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                            if s[7] == '3':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭೂತಕಾಲ"+"\t" + "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಸ್ತ್ರೀಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ  "+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t"+"ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಸ್ತ್ರೀಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t"+ "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಸ್ತ್ರೀಲಿಂಗ ಲಿಂಗ"+"\n")
                            if s[7] == '4':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭೂತಕಾಲ"+"\t" + "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t" + "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t" + "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                            if s[7] == '5':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭೂತಕಾಲ"+"\t" + "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ತಟಸ್ಥ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t" + "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ತಟಸ್ಥ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t" + "ಮೂರನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ತಟಸ್ಥ ಲಿಂಗ"+"\n")
                            if s[7] == '6':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭೂತಕಾಲ"+"\t" +"ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t" +"ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t" +"ಮೂರನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಪುಲ್ಲಿಂಗ ಲಿಂಗ"+"\n")
                            if s[7] == '7':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭೂತಕಾಲ"+"\t"  + "ಎರಡನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t"  + "ಎರಡನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t"  + "ಎರಡನೇ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                            if s[7] == '8':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭೂತಕಾಲ"+"\t"+"ಎರಡನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t"+"ಎರಡನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t"+"ಎರಡನೇ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                            if s[7] == '9':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭೂತಕಾಲ"+"\t"+ "ಮೊದಲ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t"+ "ಮೊದಲ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t"+ "ಮೊದಲ ವ್ಯಕ್ತಿ, ಏಕವಚನ, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                            if s[7] == '10':
                                if "S" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ಭೂತಕಾಲ"+"\t"+"ಮೊದಲ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "F" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ"+"\t"+"ಭವಿಷ್ಯತ್ಕಾಲ"+"\t"+ "ಮೊದಲ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
                                if "R" in s[6]:
                                    a.write (s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"ಕ್ರಿಯಾಪದ "+"\t"+"ವರ್ತಮಾನ ಕಾಲ"+"\t"+ "ಮೊದಲ ವ್ಯಕ್ತಿ, ಪ್ಲುಲರ್, ಎಲ್ಲಾ ಲಿಂಗ"+"\n")
        if flag == 0:
            if s[0] == '2':
                g.write(s[1]+"\t"+s[2]+"\t"+s[3]+"\t"+s[4]+"\t"+s[5]+"\t"+"Root word is not in the lexicon"+"\n")
    
    a.close()
    g.close()
    
    return render_template('f1.html')
        

    
if __name__=="__main__":
    app.run()
               
                                        
                                
                       
           
    
                                    
